Revit 2022 API
SetupEnergySimulationDialog Constructor
 Constructs a new instance of the SetupEnergySimulationDialog class.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2016
Syntax
C#
public SetupEnergySimulationDialog()
Visual Basic
Public Sub New
Visual C++
public:
SetupEnergySimulationDialog()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The user has not signed in to their Autodesk account.
See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace